In [1]:
import psycopg2
import random
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, text
from faker import Faker

### Set up a connection to the PostgreSQL database

In [2]:
f = open("credentials\credentials_aws.txt")
lines=f.readlines()
host=lines[0][7:-1].strip()
database=lines[1][11:].strip()
user=lines[2][7:].strip()
password=lines[3][11:].strip()
port=lines[4][7:].strip()
url=lines[5][6:].strip()
f.close()

In [3]:
print("host:", host)
print("database:", database)
print("user:", user)
print("password:", password)
print("port:", port)
print("url:", url)

host: database-1.chaf71z5ycev.eu-north-1.rds.amazonaws.com
database: database-1 # Don't use this line for AWS
user: postgres
password: edemdb1234
port: 5432
url: postgresql://postgres:edemdb1234@database-1.chaf71z5ycev.eu-north-1.rds.amazonaws.com:5432/

In [4]:
def update_db(query):
    conn = psycopg2.connect(
    host=host,
    user=user,
    password=password,
    port=port
    )

    cur = conn.cursor()

    cur.execute(query)

    conn.commit()
    cur.close()
    conn.close()

    return "Database has been updated"

In [5]:
def check_db(query):
    engine = create_engine(url)
    
    return pd.read_sql_query(text(query), con=engine.connect())

In [6]:
def check_db2(query):
    conn = psycopg2.connect(
    host=host,
    user=user,
    password=password,
    port=port
    )

    cur = conn.cursor()

    cur.execute(query)
    result = cur.fetchall()

    conn.commit()
    cur.close()
    conn.close()

    return result

In [7]:
def insert_users_db(query, values):
    conn = psycopg2.connect(
        host=host,
        user=user,
        password=password,
        port=port
        )

    cur = conn.cursor()

    cur.execute(query, values)

    conn.commit()
    cur.close()
    conn.close()

    return "Database has been updated"

### Create "categories" table

In [14]:
# update_db("DROP TABLE if exists categories cascade")

'Database has been updated'

In [15]:
# Create table
query = """
    CREATE TABLE categories(
        category_id SERIAL PRIMARY KEY,
        name VARCHAR(50)
    )
"""
update_db(query)

# Insert data
query = """
    INSERT INTO categories (name)
    VALUES
        ('Marketing'),
        ('Finance and Investment'),
        ('Management Skills'),
        ('Business Management'),
        ('Tech'),
        ('Entrepreneurship'),
        ('Artificial Intelligence'),
        ('Crypto'),
        ('Sport'),
        ('Economy'),
        ('Networking'),
        ('Sustainability'),
        ('Design'),
        ('Music'),
        ('HR'),
        ('Employment')
"""
update_db(query)

'Database has been updated'

### Check "categories" table

In [8]:
query = "SELECT * FROM categories"
check_db(query)

    category_id                     name
0             1                Marketing
1             2   Finance and Investment
2             3        Management Skills
3             4      Business Management
4             5                     Tech
5             6         Entrepreneurship
6             7  Artificial Intelligence
7             8                   Crypto
8             9                    Sport
9            10                  Economy
10           11               Networking
11           12           Sustainability
12           13                   Design
13           14                    Music
14           15                       HR
15           16               Employment

### Create "events" table

In [ ]:
# update_db("DROP TABLE if exists events cascade")

In [ ]:
# Create table
query = """
    CREATE TABLE events(
        event_id SERIAL PRIMARY KEY,
        title VARCHAR(100),
        description TEXT,
        date TIMESTAMP,
        category_id INTEGER,
        CONSTRAINT fk_categories FOREIGN KEY (category_id) REFERENCES categories(category_id)
    )
"""
update_db(query)

# Insert data
query = """
    INSERT INTO events (title, description, date, category_id)
    VALUES
        ('HR INTERNATIONAL SUMMER SCHOOL', 'empty', '2023-06-22 00:00:00', '2'),
        ('OPEN DAY BOOTCAMPS EDEM POWERED BY THE BRIDGE', 'empty', '2023-07-04 19:00:00', '3'),
        ('ENCUENTRO CON ERIC MASKIN, PREMIO NOBEL DE ECONOMÍA 2007', 'empty', '2023-06-05 11:30:00', '1')
"""
update_db(query)

### Check "events" table

In [9]:
query = "SELECT * FROM events"
check_db(query)

,event_id,title,description,date,category_id
0,1,HR INTERNATIONAL SUMMER SCHOOL,empty,2023-06-22 00:00:00,2
1,2,OPEN DAY BOOTCAMPS EDEM POWERED BY THE BRIDGE,empty,2023-07-04 19:00:00,3
2,3,"ENCUENTRO CON ERIC MASKIN, PREMIO NOBEL DE ECO...",empty,2023-06-05 11:30:00,1

### Create "students_df" dataframe first and then convert the dataframe into SQL table

Column "gender"

In [10]:
# Set the seed value
seed_value = 42

# Set the seed for random module
random.seed(seed_value)

male_count = 481
female_count = 253

genders = []
for _ in range(male_count):
    genders.append("male")

for _ in range(female_count):
    genders.append("female")

random.shuffle(genders)

students_df = pd.DataFrame(genders, columns=["gender"])
students_df

     gender
0    female
1    female
2    female
3      male
4      male
..      ...
729    male
730    male
731    male
732    male
733  female

[734 rows x 1 columns]

Column "name"

In [11]:
fake = Faker('es_ES')
fake.seed_instance(seed_value)

names = []
surnames = []

for gen in students_df["gender"]:
    if gen == "male":
        names.append(fake.first_name_male())
        surnames.append(fake.last_name_male())
    elif gen == "female":
        names.append(fake.first_name_female())
        surnames.append(fake.last_name_female())

students_df["name"] = names
students_df["surname"] = surnames

students_df

     gender          name    surname
0    female       Micaela     Cantón
1    female        Aitana     Llopis
2    female       Delfina      Godoy
3      male  Buenaventura  Calatayud
4      male          Nilo      Bonet
..      ...           ...        ...
729    male      Faustino       Jara
730    male        Glauco  Corominas
731    male      Olegario    Sánchez
732    male     Anastasio        Bou
733  female        Selena   Blázquez

[734 rows x 3 columns]

Columns "programme" and "year"

In [12]:
prog_year = {
    ('BSc in Engineering and Management', '1'): 65, ('BSc in Engineering and Management', '2'): 42, ('BSc in Engineering and Management', '3'): 28, ('BSc in Engineering and Management', '4'): 29,
    ('BBA in Business Administration', '1'): 128, ('BBA in Business Administration', '2'): 92, ('BBA in Business Administration', '3'): 83, ('BBA in Business Administration', '4'): 72,
    ('Master Marketing and Digital Sales', '1'): 61, ('Master Marketing and Digital Sales', '2'): 0, ('Master Marketing and Digital Sales', '3'): 0, ('Master Marketing and Digital Sales', '4'): 0,
    ('Master Data Analytics', '1'): 30, ('Master Data Analytics', '2'): 0, ('Master Data Analytics', '3'): 0, ('Master Data Analytics', '4'): 0,
    ('Master Finance', '1'): 19, ('Master Finance', '2'): 0, ('Master Finance', '3'): 0, ('Master Finance', '4'): 0,
    ('MBA Junior', '1'): 41, ('MBA Junior', '2'): 0, ('MBA Junior', '3'): 0, ('MBA Junior', '4'): 0,
    ('Bootcamp Data Science', '1'): 17, ('Bootcamp Data Science', '2'): 0, ('Bootcamp Data Science', '3'): 0, ('Bootcamp Data Science', '4'): 0,
    ('Bootcamp Full Stack', '1'): 14, ('Bootcamp Full Stack', '2'): 0, ('Bootcamp Full Stack', '3'): 0, ('Bootcamp Full Stack', '4'): 0,
    ('Bootcamp UX/ UI', '1'): 7, ('Bootcamp UX/ UI', '2'): 0, ('Bootcamp UX/ UI', '3'): 0, ('Bootcamp UX/ UI', '4'): 0,
    ('Bootcamp Cybersecurity', '1'): 6, ('Bootcamp Cybersecurity', '2'): 0, ('Bootcamp Cybersecurity', '3'): 0, ('Bootcamp Cybersecurity', '4'): 0,
}

# Set the seed for random module
random.seed(seed_value)

students_df["prog_year"] = students_df.apply(
    lambda row: random.choices(list(prog_year.keys()), weights=list(prog_year.values()))[0],
    axis=1
)

# Create the "programme" column
students_df["programme"] = students_df["prog_year"].apply(lambda row: row[0])

# Create the "year_of_study" column
students_df["year"] = students_df["prog_year"].apply(lambda row: row[1])

students_df

,gender,name,surname,prog_year,programme,year
0,female,Micaela,Cantón,"(BBA in Business Administration, 4)",BBA in Business Administration,4
1,female,Aitana,Llopis,"(BSc in Engineering and Management, 1)",BSc in Engineering and Management,1
2,female,Delfina,Godoy,"(BBA in Business Administration, 1)",BBA in Business Administration,1
3,male,Buenaventura,Calatayud,"(BSc in Engineering and Management, 4)",BSc in Engineering and Management,4
4,male,Nilo,Bonet,"(Master Marketing and Digital Sales, 1)",Master Marketing and Digital Sales,1
...,...,...,...,...,...,...
729,male,Faustino,Jara,"(Master Marketing and Digital Sales, 1)",Master Marketing and Digital Sales,1
730,male,Glauco,Corominas,"(BBA in Business Administration, 2)",BBA in Business Administration,2
731,male,Olegario,Sánchez,"(BBA in Business Administration, 4)",BBA in Business Administration,4
732,male,Anastasio,Bou,"(MBA Junior, 1)",MBA Junior,1
733,female,Selena,Blázquez,"(BSc in Engineering and Management, 3)",BSc in Engineering and Management,3

In [13]:
# Delete "prog_year" column
students_df = students_df.drop("prog_year", axis=1)
students_df.head()

   gender          name    surname                           programme year
0  female       Micaela     Cantón      BBA in Business Administration    4
1  female        Aitana     Llopis   BSc in Engineering and Management    1
2  female       Delfina      Godoy      BBA in Business Administration    1
3    male  Buenaventura  Calatayud   BSc in Engineering and Management    4
4    male          Nilo      Bonet  Master Marketing and Digital Sales    1

In [14]:
students_df.groupby("programme")["name"].count()

programme
BBA in Business Administration        373
BSc in Engineering and Management     167
Bootcamp Cybersecurity                 10
Bootcamp Data Science                  20
Bootcamp Full Stack                    12
Bootcamp UX/ UI                         7
MBA Junior                             31
Master Data Analytics                  29
Master Finance                         27
Master Marketing and Digital Sales     58
Name: name, dtype: int64

Column "email" (school_email)

In [15]:
# Generate school_email based on "first_name" and "last_name"
students_df["email"] = (students_df["name"].str.lower().str.replace(" ", "") +
                     students_df["surname"].str.lower().str.replace(" ", "") +
                     "@edem.es")

students_df

,gender,name,surname,programme,year,email
0,female,Micaela,Cantón,BBA in Business Administration,4,micaelacantón@edem.es
1,female,Aitana,Llopis,BSc in Engineering and Management,1,aitanallopis@edem.es
2,female,Delfina,Godoy,BBA in Business Administration,1,delfinagodoy@edem.es
3,male,Buenaventura,Calatayud,BSc in Engineering and Management,4,buenaventuracalatayud@edem.es
4,male,Nilo,Bonet,Master Marketing and Digital Sales,1,nilobonet@edem.es
...,...,...,...,...,...,...
729,male,Faustino,Jara,Master Marketing and Digital Sales,1,faustinojara@edem.es
730,male,Glauco,Corominas,BBA in Business Administration,2,glaucocorominas@edem.es
731,male,Olegario,Sánchez,BBA in Business Administration,4,olegariosánchez@edem.es
732,male,Anastasio,Bou,MBA Junior,1,anastasiobou@edem.es
733,female,Selena,Blázquez,BSc in Engineering and Management,3,selenablázquez@edem.es

Column "age"

In [16]:
# Set the seed for the random module
random.seed(seed_value)

age_range_1 = [18, 19, 20, 21, 22]
age_range_2 = [23, 24, 25, 26, 27]
age_range_3 = [x for x in range(20, 51)]

mask_1_2 = students_df["programme"].isin(['BSc in Engineering and Management', 'BBA in Business Administration'])
mask_3_to_7 = students_df["programme"].isin(['Master Marketing and Digital Sales', 'Master Data Analytics', 'Master Finance', 'MBA Junior'])
mask_8_to_13 = students_df["programme"].isin(['Bootcamp Data Science', 'Bootcamp Full Stack', 'Bootcamp UX/ UI', 'Bootcamp Cybersecurity'])

students_df.loc[mask_1_2, "age"] = random.choices(age_range_1, weights=[5, 3, 1, 1, 0], k=mask_1_2.sum())
students_df.loc[mask_3_to_7, "age"] = random.choices(age_range_2, weights=[2, 2, 2, 2, 2], k=mask_3_to_7.sum())

weights_3_to_13 = [1 / (x - 19) for x in range(20, 51)]
students_df.loc[mask_8_to_13, "age"] = random.choices(age_range_3, weights=weights_3_to_13, k=mask_8_to_13.sum())

students_df

,gender,name,surname,programme,year,email,age
0,female,Micaela,Cantón,BBA in Business Administration,4,micaelacantón@edem.es,19.0
1,female,Aitana,Llopis,BSc in Engineering and Management,1,aitanallopis@edem.es,18.0
2,female,Delfina,Godoy,BBA in Business Administration,1,delfinagodoy@edem.es,18.0
3,male,Buenaventura,Calatayud,BSc in Engineering and Management,4,buenaventuracalatayud@edem.es,18.0
4,male,Nilo,Bonet,Master Marketing and Digital Sales,1,nilobonet@edem.es,27.0
...,...,...,...,...,...,...,...
729,male,Faustino,Jara,Master Marketing and Digital Sales,1,faustinojara@edem.es,23.0
730,male,Glauco,Corominas,BBA in Business Administration,2,glaucocorominas@edem.es,19.0
731,male,Olegario,Sánchez,BBA in Business Administration,4,olegariosánchez@edem.es,19.0
732,male,Anastasio,Bou,MBA Junior,1,anastasiobou@edem.es,23.0
733,female,Selena,Blázquez,BSc in Engineering and Management,3,selenablázquez@edem.es,18.0

In [17]:
# Change "age" column dtype
students_df = students_df.astype({"age": "int64"})

students_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 734 entries, 0 to 733
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   gender     734 non-null    object
 1   name       734 non-null    object
 2   surname    734 non-null    object
 3   programme  734 non-null    object
 4   year       734 non-null    object
 5   email      734 non-null    object
 6   age        734 non-null    int64
dtypes: int64(1), object(6)
memory usage: 40.3+ KB

Arrange the "students_df" columns

In [18]:
students_df.columns

Index(['gender', 'name', 'surname', 'programme', 'year', 'email', 'age'], dtype='object')

In [19]:
students_df = students_df[["name", "surname", "gender", "age", "year", "email", "programme"]]
students_df

,name,surname,gender,age,year,email,programme
0,Micaela,Cantón,female,19,4,micaelacantón@edem.es,BBA in Business Administration
1,Aitana,Llopis,female,18,1,aitanallopis@edem.es,BSc in Engineering and Management
2,Delfina,Godoy,female,18,1,delfinagodoy@edem.es,BBA in Business Administration
3,Buenaventura,Calatayud,male,18,4,buenaventuracalatayud@edem.es,BSc in Engineering and Management
4,Nilo,Bonet,male,27,1,nilobonet@edem.es,Master Marketing and Digital Sales
...,...,...,...,...,...,...,...
729,Faustino,Jara,male,23,1,faustinojara@edem.es,Master Marketing and Digital Sales
730,Glauco,Corominas,male,19,2,glaucocorominas@edem.es,BBA in Business Administration
731,Olegario,Sánchez,male,19,4,olegariosánchez@edem.es,BBA in Business Administration
732,Anastasio,Bou,male,23,1,anastasiobou@edem.es,MBA Junior
733,Selena,Blázquez,female,18,3,selenablázquez@edem.es,BSc in Engineering and Management

Double check whether the "users_df" data is aligned with the data provided by EDEM

In [20]:
students_df.groupby("programme")["email"].count()

programme
BBA in Business Administration        373
BSc in Engineering and Management     167
Bootcamp Cybersecurity                 10
Bootcamp Data Science                  20
Bootcamp Full Stack                    12
Bootcamp UX/ UI                         7
MBA Junior                             31
Master Data Analytics                  29
Master Finance                         27
Master Marketing and Digital Sales     58
Name: email, dtype: int64

In [21]:
students_df.groupby(["programme", "year"])["email"].count()

programme                           year
BBA in Business Administration      1       122
                                    2        89
                                    3        85
                                    4        77
BSc in Engineering and Management   1        64
                                    2        40
                                    3        24
                                    4        39
Bootcamp Cybersecurity              1        10
Bootcamp Data Science               1        20
Bootcamp Full Stack                 1        12
Bootcamp UX/ UI                     1         7
MBA Junior                          1        31
Master Data Analytics               1        29
Master Finance                      1        27
Master Marketing and Digital Sales  1        58
Name: email, dtype: int64

In [22]:
students_df.groupby("gender")["email"].count()

gender
female    253
male      481
Name: email, dtype: int64

In [23]:
students_df.groupby(["programme", "year", "gender"])["email"].count()

programme                           year  gender
BBA in Business Administration      1     female    32
                                          male      90
                                    2     female    30
                                          male      59
                                    3     female    29
                                          male      56
                                    4     female    30
                                          male      47
BSc in Engineering and Management   1     female    24
                                          male      40
                                    2     female    14
                                          male      26
                                    3     female     9
                                          male      15
                                    4     female    13
                                          male      26
Bootcamp Cybersecurity              1     female     2
                                          male       8
Bootcamp Data Science               1     female     8
                                          male      12
Bootcamp Full Stack                 1     female     4
                                          male       8
Bootcamp UX/ UI                     1     female     2
                                          male       5
MBA Junior                          1     female    10
                                          male      21
Master Data Analytics               1     female    10
                                          male      19
Master Finance                      1     female     5
                                          male      22
Master Marketing and Digital Sales  1     female    31
                                          male      27
Name: email, dtype: int64

Comment:
- The number of students per gender that was randomly generated, is the same as the one provided by EDEM, but when we tried to break it down based on the programmes/majors and year of study, there is a slight difference in the figures generated randomly (distribution of the data). 
- Overall, the random data is quite aligned with the data provided by EDEM.

Create "category_id" column

In [24]:
query = "SELECT * FROM categories"
category_id_df = check_db(query)
category_id_df

    category_id                     name
0             1                Marketing
1             2   Finance and Investment
2             3        Management Skills
3             4      Business Management
4             5                     Tech
5             6         Entrepreneurship
6             7  Artificial Intelligence
7             8                   Crypto
8             9                    Sport
9            10                  Economy
10           11               Networking
11           12           Sustainability
12           13                   Design
13           14                    Music
14           15                       HR
15           16               Employment

In [25]:
category_id_df["category_id"].to_list()

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]

In [26]:
interests = category_id_df["category_id"].to_list()

random.seed(seed_value)

def generate_categories(row):
    num_categories = random.randint(1, len(interests))
    categories = random.sample(interests, k=num_categories)
    return categories

students_df["category_id"] = students_df.apply(generate_categories, axis=1)

students_df

,name,surname,gender,age,year,email,programme,category_id
0,Micaela,Cantón,female,19,4,micaelacantón@edem.es,BBA in Business Administration,"[1, 12, 5, 4]"
1,Aitana,Llopis,female,18,1,aitanallopis@edem.es,BSc in Engineering and Management,"[5, 12, 2, 11, 15, 9, 14, 7]"
2,Delfina,Godoy,female,18,1,delfinagodoy@edem.es,BBA in Business Administration,"[1, 2]"
3,Buenaventura,Calatayud,male,18,4,buenaventuracalatayud@edem.es,BSc in Engineering and Management,"[8, 9, 10, 1, 15, 4, 12]"
4,Nilo,Bonet,male,27,1,nilobonet@edem.es,Master Marketing and Digital Sales,"[8, 16, 10, 5, 1, 3, 7, 6, 13, 2, 14, 11, 12, 4]"
...,...,...,...,...,...,...,...,...
729,Faustino,Jara,male,23,1,faustinojara@edem.es,Master Marketing and Digital Sales,"[16, 12, 2, 3]"
730,Glauco,Corominas,male,19,2,glaucocorominas@edem.es,BBA in Business Administration,"[15, 9, 2, 16, 10, 14, 4, 8, 11]"
731,Olegario,Sánchez,male,19,4,olegariosánchez@edem.es,BBA in Business Administration,"[2, 15, 6, 9, 1, 8, 11, 13, 10, 5]"
732,Anastasio,Bou,male,23,1,anastasiobou@edem.es,MBA Junior,"[14, 6, 13, 5, 16, 3, 1, 12, 9, 10, 15]"
733,Selena,Blázquez,female,18,3,selenablázquez@edem.es,BSc in Engineering and Management,"[6, 10, 1, 11, 5, 15, 14, 12, 8, 13, 2, 9, 7, ..."

In [27]:
# Check whether or not there is a repetition in category list per each row
def check_category_repetition(row):
    categories = row["category_id"]
    return len(categories) != len(set(categories))

students_df["repeated_categories"] = students_df.apply(check_category_repetition, axis=1)

students_df

,name,surname,gender,age,year,email,programme,category_id,repeated_categories
0,Micaela,Cantón,female,19,4,micaelacantón@edem.es,BBA in Business Administration,"[1, 12, 5, 4]",False
1,Aitana,Llopis,female,18,1,aitanallopis@edem.es,BSc in Engineering and Management,"[5, 12, 2, 11, 15, 9, 14, 7]",False
2,Delfina,Godoy,female,18,1,delfinagodoy@edem.es,BBA in Business Administration,"[1, 2]",False
3,Buenaventura,Calatayud,male,18,4,buenaventuracalatayud@edem.es,BSc in Engineering and Management,"[8, 9, 10, 1, 15, 4, 12]",False
4,Nilo,Bonet,male,27,1,nilobonet@edem.es,Master Marketing and Digital Sales,"[8, 16, 10, 5, 1, 3, 7, 6, 13, 2, 14, 11, 12, 4]",False
...,...,...,...,...,...,...,...,...,...
729,Faustino,Jara,male,23,1,faustinojara@edem.es,Master Marketing and Digital Sales,"[16, 12, 2, 3]",False
730,Glauco,Corominas,male,19,2,glaucocorominas@edem.es,BBA in Business Administration,"[15, 9, 2, 16, 10, 14, 4, 8, 11]",False
731,Olegario,Sánchez,male,19,4,olegariosánchez@edem.es,BBA in Business Administration,"[2, 15, 6, 9, 1, 8, 11, 13, 10, 5]",False
732,Anastasio,Bou,male,23,1,anastasiobou@edem.es,MBA Junior,"[14, 6, 13, 5, 16, 3, 1, 12, 9, 10, 15]",False
733,Selena,Blázquez,female,18,3,selenablázquez@edem.es,BSc in Engineering and Management,"[6, 10, 1, 11, 5, 15, 14, 12, 8, 13, 2, 9, 7, ...",False

In [28]:
students_df["repeated_categories"].unique()

array([False])

In [29]:
# Remove the "repeated_categories" column
students_df = students_df.drop("repeated_categories", axis=1)

In [30]:
students_df

,name,surname,gender,age,year,email,programme,category_id
0,Micaela,Cantón,female,19,4,micaelacantón@edem.es,BBA in Business Administration,"[1, 12, 5, 4]"
1,Aitana,Llopis,female,18,1,aitanallopis@edem.es,BSc in Engineering and Management,"[5, 12, 2, 11, 15, 9, 14, 7]"
2,Delfina,Godoy,female,18,1,delfinagodoy@edem.es,BBA in Business Administration,"[1, 2]"
3,Buenaventura,Calatayud,male,18,4,buenaventuracalatayud@edem.es,BSc in Engineering and Management,"[8, 9, 10, 1, 15, 4, 12]"
4,Nilo,Bonet,male,27,1,nilobonet@edem.es,Master Marketing and Digital Sales,"[8, 16, 10, 5, 1, 3, 7, 6, 13, 2, 14, 11, 12, 4]"
...,...,...,...,...,...,...,...,...
729,Faustino,Jara,male,23,1,faustinojara@edem.es,Master Marketing and Digital Sales,"[16, 12, 2, 3]"
730,Glauco,Corominas,male,19,2,glaucocorominas@edem.es,BBA in Business Administration,"[15, 9, 2, 16, 10, 14, 4, 8, 11]"
731,Olegario,Sánchez,male,19,4,olegariosánchez@edem.es,BBA in Business Administration,"[2, 15, 6, 9, 1, 8, 11, 13, 10, 5]"
732,Anastasio,Bou,male,23,1,anastasiobou@edem.es,MBA Junior,"[14, 6, 13, 5, 16, 3, 1, 12, 9, 10, 15]"
733,Selena,Blázquez,female,18,3,selenablázquez@edem.es,BSc in Engineering and Management,"[6, 10, 1, 11, 5, 15, 14, 12, 8, 13, 2, 9, 7, ..."

In [31]:
# Test category mapping
category_map = list(category_id_df.set_index("category_id").to_dict().values())[0]
category_map

{1: 'Marketing',
 2: 'Finance and Investment',
 3: 'Management Skills',
 4: 'Business Management',
 5: 'Tech',
 6: 'Entrepreneurship',
 7: 'Artificial Intelligence',
 8: 'Crypto',
 9: 'Sport',
 10: 'Economy',
 11: 'Networking',
 12: 'Sustainability',
 13: 'Design',
 14: 'Music',
 15: 'HR',
 16: 'Employment'}

In [32]:
students_df['category'] = students_df['category_id'].apply(lambda x: [category_map.get(category) for category in x])
students_df

,name,surname,gender,age,year,email,programme,category_id,category
0,Micaela,Cantón,female,19,4,micaelacantón@edem.es,BBA in Business Administration,"[1, 12, 5, 4]","[Marketing, Sustainability, Tech, Business Man..."
1,Aitana,Llopis,female,18,1,aitanallopis@edem.es,BSc in Engineering and Management,"[5, 12, 2, 11, 15, 9, 14, 7]","[Tech, Sustainability, Finance and Investment,..."
2,Delfina,Godoy,female,18,1,delfinagodoy@edem.es,BBA in Business Administration,"[1, 2]","[Marketing, Finance and Investment]"
3,Buenaventura,Calatayud,male,18,4,buenaventuracalatayud@edem.es,BSc in Engineering and Management,"[8, 9, 10, 1, 15, 4, 12]","[Crypto, Sport, Economy, Marketing, HR, Busine..."
4,Nilo,Bonet,male,27,1,nilobonet@edem.es,Master Marketing and Digital Sales,"[8, 16, 10, 5, 1, 3, 7, 6, 13, 2, 14, 11, 12, 4]","[Crypto, Employment, Economy, Tech, Marketing,..."
...,...,...,...,...,...,...,...,...,...
729,Faustino,Jara,male,23,1,faustinojara@edem.es,Master Marketing and Digital Sales,"[16, 12, 2, 3]","[Employment, Sustainability, Finance and Inves..."
730,Glauco,Corominas,male,19,2,glaucocorominas@edem.es,BBA in Business Administration,"[15, 9, 2, 16, 10, 14, 4, 8, 11]","[HR, Sport, Finance and Investment, Employment..."
731,Olegario,Sánchez,male,19,4,olegariosánchez@edem.es,BBA in Business Administration,"[2, 15, 6, 9, 1, 8, 11, 13, 10, 5]","[Finance and Investment, HR, Entrepreneurship,..."
732,Anastasio,Bou,male,23,1,anastasiobou@edem.es,MBA Junior,"[14, 6, 13, 5, 16, 3, 1, 12, 9, 10, 15]","[Music, Entrepreneurship, Design, Tech, Employ..."
733,Selena,Blázquez,female,18,3,selenablázquez@edem.es,BSc in Engineering and Management,"[6, 10, 1, 11, 5, 15, 14, 12, 8, 13, 2, 9, 7, ...","[Entrepreneurship, Economy, Marketing, Network..."

Create "student_id" column

In [33]:
students_df.columns

Index(['name', 'surname', 'gender', 'age', 'year', 'email', 'programme',
       'category_id', 'category'],
      dtype='object')

In [34]:
# Add "student_id" column into "students_df" dataframe. This column will be a primary key in SQL and will be filled in automatically in SQL
students_df["student_id"] = [x for x in range (1, 735)]

# Put the "student_id" in the first column
students_df = students_df[['student_id', 'email', 'name', 'surname', 'gender', 'age', 'programme', 'year', 'category_id', 
                           'category']]

students_df.head()

,student_id,email,name,surname,gender,age,programme,year,category_id,category
0,1,micaelacantón@edem.es,Micaela,Cantón,female,19,BBA in Business Administration,4,"[1, 12, 5, 4]","[Marketing, Sustainability, Tech, Business Man..."
1,2,aitanallopis@edem.es,Aitana,Llopis,female,18,BSc in Engineering and Management,1,"[5, 12, 2, 11, 15, 9, 14, 7]","[Tech, Sustainability, Finance and Investment,..."
2,3,delfinagodoy@edem.es,Delfina,Godoy,female,18,BBA in Business Administration,1,"[1, 2]","[Marketing, Finance and Investment]"
3,4,buenaventuracalatayud@edem.es,Buenaventura,Calatayud,male,18,BSc in Engineering and Management,4,"[8, 9, 10, 1, 15, 4, 12]","[Crypto, Sport, Economy, Marketing, HR, Busine..."
4,5,nilobonet@edem.es,Nilo,Bonet,male,27,Master Marketing and Digital Sales,1,"[8, 16, 10, 5, 1, 3, 7, 6, 13, 2, 14, 11, 12, 4]","[Crypto, Employment, Economy, Tech, Marketing,..."

In [35]:
students_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 734 entries, 0 to 733
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   student_id   734 non-null    int64
 1   email        734 non-null    object
 2   name         734 non-null    object
 3   surname      734 non-null    object
 4   gender       734 non-null    object
 5   age          734 non-null    int64
 6   programme    734 non-null    object
 7   year         734 non-null    object
 8   category_id  734 non-null    object
 9   category     734 non-null    object
dtypes: int64(2), object(8)
memory usage: 57.5+ KB

In [36]:
# Save the dataframe in CSV for ML training purpose
students_df.to_csv("data_ds/students_df.csv")

Convert the "students_df" dataframe into "students" table in PostgreSQL

In [37]:
# update_db("DROP TABLE if exists students cascade")

'Database has been updated'

In [38]:
# Create table
query = """
	CREATE TABLE students(
		student_id SERIAL PRIMARY KEY,
        email VARCHAR(255),
		name VARCHAR(255),
		surname VARCHAR(255),
		gender VARCHAR(10),
		age INTEGER,
		programme VARCHAR(255),
        year VARCHAR(20),
        category_id INTEGER[],
        category TEXT[]
	)
"""
update_db(query)

'Database has been updated'

In [39]:
students_df.columns

Index(['student_id', 'email', 'name', 'surname', 'gender', 'age', 'programme',
       'year', 'category_id', 'category'],
      dtype='object')

In [40]:
def insert_users_db(query, values):
    conn = psycopg2.connect(
        host=host,
        user=user,
        password=password,
        port=port
        )

    cur = conn.cursor()

    cur.execute(query, values)

    conn.commit()
    cur.close()
    conn.close()

    return "Database has been updated"

# Iterate over each row in the DataFrame and insert data into the "students" table
for index, row in students_df.iterrows():
    student_id = row['student_id']
    email = row['email']
    name = row['name']
    surname = row['surname']
    gender = row['gender']
    age = row['age']
    programme = row['programme']
    year = row['year']
    category_id = row['category_id']
    category = row['category']

    # Generate the SQL query with placeholders for parameters
    query = "INSERT INTO students (student_id, email, name, surname, gender, age, programme, year, category_id, category) " \
            "VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)"

    # Create a tuple of values to be inserted into the query
    values = (student_id, email, name, surname, gender, age, programme, year, category_id, category)

    # Call the update_db function to execute the query with the parameter values
    insert_users_db(query, values)

print("Data insertion into the 'students' table is complete.")

Data insertion into the 'students' table is complete.

In [41]:
check_db("SELECT * FROM students")

,student_id,email,name,surname,gender,age,programme,year,category_id,category
0,1,micaelacantón@edem.es,Micaela,Cantón,female,19,BBA in Business Administration,4,"[1, 12, 5, 4]","[Marketing, Sustainability, Tech, Business Man..."
1,2,aitanallopis@edem.es,Aitana,Llopis,female,18,BSc in Engineering and Management,1,"[5, 12, 2, 11, 15, 9, 14, 7]","[Tech, Sustainability, Finance and Investment,..."
2,3,delfinagodoy@edem.es,Delfina,Godoy,female,18,BBA in Business Administration,1,"[1, 2]","[Marketing, Finance and Investment]"
3,4,buenaventuracalatayud@edem.es,Buenaventura,Calatayud,male,18,BSc in Engineering and Management,4,"[8, 9, 10, 1, 15, 4, 12]","[Crypto, Sport, Economy, Marketing, HR, Busine..."
4,5,nilobonet@edem.es,Nilo,Bonet,male,27,Master Marketing and Digital Sales,1,"[8, 16, 10, 5, 1, 3, 7, 6, 13, 2, 14, 11, 12, 4]","[Crypto, Employment, Economy, Tech, Marketing,..."
...,...,...,...,...,...,...,...,...,...,...
729,730,faustinojara@edem.es,Faustino,Jara,male,23,Master Marketing and Digital Sales,1,"[16, 12, 2, 3]","[Employment, Sustainability, Finance and Inves..."
730,731,glaucocorominas@edem.es,Glauco,Corominas,male,19,BBA in Business Administration,2,"[15, 9, 2, 16, 10, 14, 4, 8, 11]","[HR, Sport, Finance and Investment, Employment..."
731,732,olegariosánchez@edem.es,Olegario,Sánchez,male,19,BBA in Business Administration,4,"[2, 15, 6, 9, 1, 8, 11, 13, 10, 5]","[Finance and Investment, HR, Entrepreneurship,..."
732,733,anastasiobou@edem.es,Anastasio,Bou,male,23,MBA Junior,1,"[14, 6, 13, 5, 16, 3, 1, 12, 9, 10, 15]","[Music, Entrepreneurship, Design, Tech, Employ..."
733,734,selenablázquez@edem.es,Selena,Blázquez,female,18,BSc in Engineering and Management,3,"[6, 10, 1, 11, 5, 15, 14, 12, 8, 13, 2, 9, 7, ...","[Entrepreneurship, Economy, Marketing, Network..."

### Create "startups" table --> Please ignore it and refer to Enrique's JSON file "startups_data.json"

In [86]:
startups_df = pd.read_json("Scrap/startups_data.json")
startups_df

,name,phase,topics,description,url,logo_link
0,Mytapper,Growth,"[alimentación, Delivery]",Mytapper permite pedir comida desde casa o des...,https://lanzadera.es/proyecto/mytapper/,https://lanzadera.es/wp-content/uploads/2023/0...
1,Beawre,Traction,"[construcción, Inteligencia Artificial]",Controla riesgos sobre procesos de negocio en ...,https://lanzadera.es/proyecto/beawre/,https://lanzadera.es/wp-content/uploads/2023/0...
2,Sitandplug,Growth,"[Digital, Software]",Sitandplug es un marketplace de oficinas y esp...,https://lanzadera.es/proyecto/sitandplug/,https://lanzadera.es/wp-content/uploads/2023/0...
3,LIIFFE APP,Traction,"[Economía circular, Viajes]",Escapadas 100% auténticas basadas en vidas de ...,https://lanzadera.es/proyecto/liiffe-app/,https://lanzadera.es/wp-content/uploads/2023/0...
4,Mundoestudiante,Scale up,"[E-Learining, Impacto social]","Mundoestudiante es la revolución, pionera en E...",https://lanzadera.es/proyecto/mundoestudiante/,https://lanzadera.es/wp-content/uploads/2023/0...
...,...,...,...,...,...,...
755,ESCUELA DE CIENCIA,Growth,"[Customer experience, Nuevas formas de conectar]",La primera escuela dedicada a fomentar la curi...,https://lanzadera.es/proyecto/escuela-de-ciencia/,https://lanzadera.es/wp-content/uploads/2017/1...
756,EKUORE,Growth,"[Digitalización, Diseño, Productos saludables]",Conecta tu salud a tu smarthphone,https://lanzadera.es/proyecto/ekuore/,https://lanzadera.es/wp-content/uploads/2017/1...
757,DENTAL DOCTORS,None,None,Revolucionando el mundo de la odontología,https://lanzadera.es/proyecto/dental-doctors/,https://lanzadera.es/wp-content/uploads/2017/1...
758,CODIGAMES,Growth,[Gaming],Desarrollo de videojuegos sociales para plataf...,https://lanzadera.es/proyecto/codigames/,https://lanzadera.es/wp-content/uploads/2017/1...
759,BYOM!,Traction,"[Business Intelligence, Customer experience]",Mostrar a los comercios la opinión de sus cons...,https://lanzadera.es/proyecto/byom/,https://lanzadera.es/wp-content/uploads/2017/1...

In [87]:
# Add "startup_id" column
startups_df["startup_id"] = [x for x in range(1, len(startups_df)+1)]

# Re-arrange the columns
startups_df = startups_df[['startup_id', 'name', 'phase', 'topics', 'description', 'url', 'logo_link']]

startups_df

,startup_id,name,phase,topics,description,url,logo_link
0,1,Mytapper,Growth,"[alimentación, Delivery]",Mytapper permite pedir comida desde casa o des...,https://lanzadera.es/proyecto/mytapper/,https://lanzadera.es/wp-content/uploads/2023/0...
1,2,Beawre,Traction,"[construcción, Inteligencia Artificial]",Controla riesgos sobre procesos de negocio en ...,https://lanzadera.es/proyecto/beawre/,https://lanzadera.es/wp-content/uploads/2023/0...
2,3,Sitandplug,Growth,"[Digital, Software]",Sitandplug es un marketplace de oficinas y esp...,https://lanzadera.es/proyecto/sitandplug/,https://lanzadera.es/wp-content/uploads/2023/0...
3,4,LIIFFE APP,Traction,"[Economía circular, Viajes]",Escapadas 100% auténticas basadas en vidas de ...,https://lanzadera.es/proyecto/liiffe-app/,https://lanzadera.es/wp-content/uploads/2023/0...
4,5,Mundoestudiante,Scale up,"[E-Learining, Impacto social]","Mundoestudiante es la revolución, pionera en E...",https://lanzadera.es/proyecto/mundoestudiante/,https://lanzadera.es/wp-content/uploads/2023/0...
...,...,...,...,...,...,...,...
755,756,ESCUELA DE CIENCIA,Growth,"[Customer experience, Nuevas formas de conectar]",La primera escuela dedicada a fomentar la curi...,https://lanzadera.es/proyecto/escuela-de-ciencia/,https://lanzadera.es/wp-content/uploads/2017/1...
756,757,EKUORE,Growth,"[Digitalización, Diseño, Productos saludables]",Conecta tu salud a tu smarthphone,https://lanzadera.es/proyecto/ekuore/,https://lanzadera.es/wp-content/uploads/2017/1...
757,758,DENTAL DOCTORS,None,None,Revolucionando el mundo de la odontología,https://lanzadera.es/proyecto/dental-doctors/,https://lanzadera.es/wp-content/uploads/2017/1...
758,759,CODIGAMES,Growth,[Gaming],Desarrollo de videojuegos sociales para plataf...,https://lanzadera.es/proyecto/codigames/,https://lanzadera.es/wp-content/uploads/2017/1...
759,760,BYOM!,Traction,"[Business Intelligence, Customer experience]",Mostrar a los comercios la opinión de sus cons...,https://lanzadera.es/proyecto/byom/,https://lanzadera.es/wp-content/uploads/2017/1...

In [88]:
unique_topics = set()
for topics_list in startups_df['topics']:
    if topics_list is not None:
        unique_topics.update(topics_list)

unique_topics.discard(None)
unique_topics = list(unique_topics)
unique_topics

['Logística',
 'Ergonomía',
 'construcción',
 'eventos',
 'Nuevas funcionalidades o usos',
 'E-Learining',
 'Ábogacía',
 'Legaltech',
 'Domótica',
 'Music',
 'Salud',
 'Robótica',
 'Marketing',
 'Decoración',
 'calzado',
 'proptech',
 'Robótica/Bots',
 'producción',
 'Ecológico',
 'Deporte',
 'Moda',
 'Foodtech',
 'Analytics',
 'Inteligencia Artificial',
 'tecnología',
 'Wearables',
 'Sports',
 'Nuevos procesos de fabricación',
 'Viajes',
 'Gamificación',
 'Real State',
 'Gaming',
 'Ciberseguridad',
 'Economía circular',
 'finanzas',
 'Videojuegos',
 'Nuevos alimentos',
 'Ecología',
 'Cleantech',
 'Realidad Virtual',
 'Energy tech',
 'Seguros',
 'Travel',
 'Biotecnología',
 'Impacto social',
 'Mobility',
 'comunicación',
 'saludable',
 'Saas',
 'Machine Learning',
 'e-learning',
 'Productos saludables',
 'medicina',
 'Economía colaborativa',
 'Nuevas formas de conectar',
 'AI',
 'BI',
 'International',
 'Data',
 'Construtech',
 'Digitali',
 'Delivery',
 'Audiovisual',
 'Movilidad',
 'Retail deportivo',
 'Cloud',
 'IoT',
 'SaaS de comunicación interna.',
 'Nuevos materiales',
 'Software',
 'Digital',
 'Customer experience',
 'Marketplace',
 'alimentación',
 'Digitalización',
 'Blockchain',
 'música',
 'Nuevas funcionalidades',
 'Space tech',
 'Personalización',
 'internacional',
 'Mental health',
 'Enterprise',
 'Contenido',
 'Trazabilidad',
 'Óptica',
 'Reconocimiento de voz',
 'Business Intelligence',
 'agricultura',
 'ecommerce',
 'Local',
 'phygital',
 'Talento',
 'Diseño']

In [89]:
len(unique_topics)

94

In [90]:
for i in unique_topics:
    print(i)

Logística
Ergonomía
construcción
eventos
Nuevas funcionalidades o usos
E-Learining
Ábogacía
Legaltech
Domótica
Music
Salud
Robótica
Marketing
Decoración
calzado
proptech
Robótica/Bots
producción
Ecológico
Deporte
Moda
Foodtech
Analytics
Inteligencia Artificial
tecnología
Wearables
Sports
Nuevos procesos de fabricación
Viajes
Gamificación
Real State
Gaming
Ciberseguridad
Economía circular
finanzas
Videojuegos
Nuevos alimentos
Ecología
Cleantech
Realidad Virtual
Energy tech
Seguros
Travel
Biotecnología
Impacto social
Mobility
comunicación
saludable
Saas
Machine Learning
e-learning
Productos saludables
medicina
Economía colaborativa
Nuevas formas de conectar
AI
BI
International
Data
Construtech
Digitali
Delivery
Audiovisual
Movilidad
Retail deportivo
Cloud
IoT
SaaS de comunicación interna.
Nuevos materiales
Software
Digital
Customer experience
Marketplace
alimentación
Digitalización
Blockchain
música
Nuevas funcionalidades
Space tech
Personalización
internacional
Mental health
Enterprise
Contenido
Trazabilidad
Óptica
Reconocimiento de voz
Business Intelligence
agricultura
ecommerce
Local
phygital
Talento
Diseño

In [67]:
startups_unique_topics_df = pd.DataFrame({'unique_topics': unique_topics})
startups_unique_topics_df

                    unique_topics
0                       Logística
1                       Ergonomía
2                    construcción
3                         eventos
4   Nuevas funcionalidades o usos
..                            ...
89                      ecommerce
90                          Local
91                       phygital
92                        Talento
93                         Diseño

[94 rows x 1 columns]

In [68]:
startups_unique_topics_df["topic_id"] = [x for x in range(1, len(startups_unique_topics_df)+1)]
startups_unique_topics_df = startups_unique_topics_df[["topic_id", "unique_topics"]]
startups_unique_topics_df

    topic_id                  unique_topics
0          1                      Logística
1          2                      Ergonomía
2          3                   construcción
3          4                        eventos
4          5  Nuevas funcionalidades o usos
..       ...                            ...
89        90                      ecommerce
90        91                          Local
91        92                       phygital
92        93                        Talento
93        94                         Diseño

[94 rows x 2 columns]

In [71]:
# Add "topic_id" column into the "startups_df" dataframe
startups_df['topic_id'] = startups_df['topics'].apply(
    lambda x: [startups_unique_topics_df[startups_unique_topics_df['unique_topics'] == topic]['topic_id'].values[0]
               for topic in x if topic is not None] if x is not None else None
)

startups_df

C:\Users\selvi\AppData\Local\Temp\ipykernel_20152\3146006945.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  startups_df['topic_id'] = startups_df['topics'].apply(

,startup_id,name,phase,topics,description,url,logo_link,topic_id
0,1,Mytapper,Growth,"[alimentación, Delivery]",Mytapper permite pedir comida desde casa o des...,https://lanzadera.es/proyecto/mytapper/,https://lanzadera.es/wp-content/uploads/2023/0...,"[74, 62]"
1,2,Beawre,Traction,"[construcción, Inteligencia Artificial]",Controla riesgos sobre procesos de negocio en ...,https://lanzadera.es/proyecto/beawre/,https://lanzadera.es/wp-content/uploads/2023/0...,"[3, 24]"
2,3,Sitandplug,Growth,"[Digital, Software]",Sitandplug es un marketplace de oficinas y esp...,https://lanzadera.es/proyecto/sitandplug/,https://lanzadera.es/wp-content/uploads/2023/0...,"[71, 70]"
3,4,LIIFFE APP,Traction,"[Economía circular, Viajes]",Escapadas 100% auténticas basadas en vidas de ...,https://lanzadera.es/proyecto/liiffe-app/,https://lanzadera.es/wp-content/uploads/2023/0...,"[34, 29]"
4,5,Mundoestudiante,Scale up,"[E-Learining, Impacto social]","Mundoestudiante es la revolución, pionera en E...",https://lanzadera.es/proyecto/mundoestudiante/,https://lanzadera.es/wp-content/uploads/2023/0...,"[6, 45]"
...,...,...,...,...,...,...,...,...
755,756,ESCUELA DE CIENCIA,Growth,"[Customer experience, Nuevas formas de conectar]",La primera escuela dedicada a fomentar la curi...,https://lanzadera.es/proyecto/escuela-de-ciencia/,https://lanzadera.es/wp-content/uploads/2017/1...,"[72, 55]"
756,757,EKUORE,Growth,"[Digitalización, Diseño, Productos saludables]",Conecta tu salud a tu smarthphone,https://lanzadera.es/proyecto/ekuore/,https://lanzadera.es/wp-content/uploads/2017/1...,"[75, 94, 52]"
757,758,DENTAL DOCTORS,None,None,Revolucionando el mundo de la odontología,https://lanzadera.es/proyecto/dental-doctors/,https://lanzadera.es/wp-content/uploads/2017/1...,None
758,759,CODIGAMES,Growth,[Gaming],Desarrollo de videojuegos sociales para plataf...,https://lanzadera.es/proyecto/codigames/,https://lanzadera.es/wp-content/uploads/2017/1...,[32]
759,760,BYOM!,Traction,"[Business Intelligence, Customer experience]",Mostrar a los comercios la opinión de sus cons...,https://lanzadera.es/proyecto/byom/,https://lanzadera.es/wp-content/uploads/2017/1...,"[88, 72]"

In [74]:
# Re-arrange the columns
startups_df = startups_df[['startup_id', 'name', 'phase', 'topics', 'topic_id', 'description', 'url', 'logo_link']]
startups_df

,startup_id,name,phase,topics,topic_id,description,url,logo_link
0,1,Mytapper,Growth,"[alimentación, Delivery]","[74, 62]",Mytapper permite pedir comida desde casa o des...,https://lanzadera.es/proyecto/mytapper/,https://lanzadera.es/wp-content/uploads/2023/0...
1,2,Beawre,Traction,"[construcción, Inteligencia Artificial]","[3, 24]",Controla riesgos sobre procesos de negocio en ...,https://lanzadera.es/proyecto/beawre/,https://lanzadera.es/wp-content/uploads/2023/0...
2,3,Sitandplug,Growth,"[Digital, Software]","[71, 70]",Sitandplug es un marketplace de oficinas y esp...,https://lanzadera.es/proyecto/sitandplug/,https://lanzadera.es/wp-content/uploads/2023/0...
3,4,LIIFFE APP,Traction,"[Economía circular, Viajes]","[34, 29]",Escapadas 100% auténticas basadas en vidas de ...,https://lanzadera.es/proyecto/liiffe-app/,https://lanzadera.es/wp-content/uploads/2023/0...
4,5,Mundoestudiante,Scale up,"[E-Learining, Impacto social]","[6, 45]","Mundoestudiante es la revolución, pionera en E...",https://lanzadera.es/proyecto/mundoestudiante/,https://lanzadera.es/wp-content/uploads/2023/0...
...,...,...,...,...,...,...,...,...
755,756,ESCUELA DE CIENCIA,Growth,"[Customer experience, Nuevas formas de conectar]","[72, 55]",La primera escuela dedicada a fomentar la curi...,https://lanzadera.es/proyecto/escuela-de-ciencia/,https://lanzadera.es/wp-content/uploads/2017/1...
756,757,EKUORE,Growth,"[Digitalización, Diseño, Productos saludables]","[75, 94, 52]",Conecta tu salud a tu smarthphone,https://lanzadera.es/proyecto/ekuore/,https://lanzadera.es/wp-content/uploads/2017/1...
757,758,DENTAL DOCTORS,None,None,None,Revolucionando el mundo de la odontología,https://lanzadera.es/proyecto/dental-doctors/,https://lanzadera.es/wp-content/uploads/2017/1...
758,759,CODIGAMES,Growth,[Gaming],[32],Desarrollo de videojuegos sociales para plataf...,https://lanzadera.es/proyecto/codigames/,https://lanzadera.es/wp-content/uploads/2017/1...
759,760,BYOM!,Traction,"[Business Intelligence, Customer experience]","[88, 72]",Mostrar a los comercios la opinión de sus cons...,https://lanzadera.es/proyecto/byom/,https://lanzadera.es/wp-content/uploads/2017/1...

In [75]:
# Create table
query = """
    CREATE TABLE startups(
        startup_id SERIAL PRIMARY KEY,
        name VARCHAR(100),
        phase VARCHAR(30),
        topics TEXT[],
        topic_id TEXT[],
        description TEXT,
        url VARCHAR(255),
        logo_link VARCHAR(255)
    )
"""
update_db(query)

'Database has been updated'

In [76]:
# Iterate over each row in the DataFrame and insert data into the "students" table
for index, row in startups_df.iterrows():
    startup_id = row['startup_id']
    name = row['name']
    phase = row['phase']
    topics = row['topics']
    description = row['description']
    url = row['url']
    logo_link = row['logo_link']

    # Generate the SQL query with placeholders for parameters
    query = "INSERT INTO startups (startup_id, name, phase, topics, description, url, logo_link) " \
            "VALUES (%s, %s, %s, %s, %s, %s, %s)"

    # Create a tuple of values to be inserted into the query
    values = (startup_id, name, phase, topics, description, url, logo_link)

    # Call the update_db function to execute the query with the parameter values
    insert_users_db(query, values)

print("Data insertion into the 'startups' table is complete.")

Data insertion into the 'startups' table is complete.